Fs = 8e3; %частота дискретизації 8 КГц
t = 0:1/Fs:1; %1 секунда дискретних моментів часу
t = t'; % перетворення рядка в стовпчик
A = 2; %амплітуда - 2 В
f0 = 2e2; %частота - 200 Гц
phi = -pi/2; %початкова фаза - 45 град
s1 = A*cos(2*pi*f0*t+phi); %гармонічний сигнал
alpha = 0.3e3; %швидкість затухання експоненти
s2 = exp(-alpha*t).*s1; %затухаюча косинусоїда

subplot(3,2,1); plot(s1(1:100)); grid;
subplot(3,2,2); plot(s2(1:100)); grid;
subplot(3,2,3); stem(s1(1:100)); grid;
subplot(3,2,4); stem(s2(1:100)); grid;
subplot(3,2,5); stairs(s1(1:100)); grid;
subplot(3,2,6); stairs(s2(1:100));
grid;